app/controllers/restaurants_controller.rb

	def index
		@restaurant = Restaurant.all
---
SELECT `restaurants`.* FROM `restaurants`

	def create
		@restaurant = current_owner.restaurants.new(params[:restaurant])
		#how does it know :restaurant exists. where did it come from?
		#rails has a convention to name :restaurant to match the model Restaurant.  I also have named it :restaurant.
		#how would I rename it, if I wanted to call it something else?
		@restaurant.save
---
INSERT INTO "restaurants" ("address", "created_at", "description", "name", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", ""], ["created_at", Wed, 30 Oct 2013 20:30:16 UTC +00:00], ["description", ""], ["name", "test"], ["phone_number", nil], ["updated_at", Wed, 30 Oct 2013 20:30:16 UTC +00:00]]

	def update
		@restaurant = current_owner.restaurants.find(params[:id])
		@restaurant.update_attributes(params[:restaurant])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "12"]]
UPDATE `restaurants` SET `street` = '16 Stuyvesant Oval', `city` = 'New York', `apt` = '16B', `state` = 'NY', `zip_code` = '10009', `photo` = 'Reuben.jpg', `updated_at` = '2013-11-05 17:11:38' WHERE `restaurants`.`id` = 14